Repository: m21power/farmer-agent
Catalog: lib/l10n/app_*.arb
Languages: am

source: Operation successful
am: ተግባሩ በተሳካ ሁኔታ ተከናውኗል

# writeImageDescription
source: Please write a description of the image
am: እባክዎን የምስሉን መግለጫ ይጻፉ

source: Failed to load history
am: ታሪኩን መጫን አልተቻለም

# saveError
source: Error occurred while saving, try again!
am: ማስቀመጥ ሲሞከር ስህተት ተፈጥሯል፣ እባክህ ደግመህ ፈትሽ።

source: Failed to load
am: መጫን አልተቻለም

source: Posting...
am: በመላክ ላይ...

source: Posted successfully
am: በተሳካ ሁኔታ ተልኳል

# noPostsYet
source: No posts yet, be the first!
am: ምንም ልጥፍ የለም፣ የመጀመሪያ ጠያቂ ይሁኑ!

source: No internet connection!
am: ኢንተርኔት አልተገኘም!

# added_new_comment
source: Added a new comment
am: አዲስ አስተያየት ተጨመረ

# added_new_question
source: Added a new question
am: አዲስ ጥያቄ ተጨመረ

# cantProcessImage
source: Can't process this image
am: ይህን ምስል መቃኘት አልተቻለም።

# noSavedHistory
source: No saved history yet.
am: ምንም የተቀመጠ ታሪክ አልተገኘም።

source: Saved successfully
am: በትክክል ተቀመጠ

source: Copied
am: ተቀድቷል

source: Copy response
am: ምላሹን ይቅዱ

source: Confirm image
am: ምስሉን ያረጋግጡ

source: Delete Question
am: ጥያቄ ሰርዝ

# confirm_delete_question
source: Are you sure you want to delete this question?
am: ይህን ጥያቄ ለመሰረዝ እርግጠኛ ነህ?

source: Delete Reply
am: መልስን ሰርዝ

# confirm_delete_reply
source: Are you sure you want to delete this reply?
am: ይህን መልስ ለመሰረዝ እርግጠኛ ነህ?

source: Edit Caption
am: መግለጫ አስተካክል

# edit_your_caption
source: Your Caption
am: መግለጫዎ

source: Edit Reply
am: መልስን አስተካክል

source: Edit your reply
am: መልስህን አስተካክል

# write_reply
source: Write your reply
am: መልስ ጻፍ

# type_reply_here
source: Type your reply here...
am: መልስህን እዚህ ጻፍ...

source: Submit Reply
am: መልስ አስገባ

source: See more
am: ተጨማሪ አሳይ

source: See less
am: ያነሰ አሳይ

source: Farmer
am: አርሶአደር

source: Expert
am: ባለሙያ

source: Admin
am: አስተዳዳሪ

source: Login
am: ግባ

source: Phone Number
am: ስልክ ቁጥር

source: Password
am: የይለፍ ቃል

source: Forgot Password
am: የይለፍ ቃል ረሱ?

# dont_have_account
source: Don't have an account?
am: መለያ የለዎትም?

source: Sign Up
am: ተመዝገብ

source: Register Farmer
am: ገበሬ መመዝገቢያ

source: Register
am: መመዝገብ

source: Confirm Delete
am: ማረጋገጫ ሰርዝ

source: Add Disease
am: በሽታ አክል

source: Edit Disease
am: በሽታ አስተካክል

source: Update Disease
am: በሽታ አዘምን

# are_you_sure_delete
source: Are you sure you want to delete this disease?
am: ይህን በሽታ ለመሰረዝ እንደምትፈልጉ እርግጠኛ ነዎት?

# app_name
source: Maize Guard
am: ማይዝ ጋርድ

source: Language
am: ቋንቋ

source: Amharic
am: አማርኛ

source: English
am: እንግሊዝኛ

source: Confirm Logout
am: መውጣት ይፈልጋሉ?

source: Are you sure you want to logout?
am: እርግጠኛ ነህ ለመውጣት?

# welcome
source: Welcome to Maize Guard! Scan your maize for expert help.
am: እንኳን ወደ Maize Guard በደህና መጡ። ለባለሙያ እርዳታ በMaize Guard ስካን ያድርጉ።

source: Scan Maize
am: በሽት መርምር

source: Profile
am: መገለጫ

source: Ask
am: ጠይቅ

source: Community
am: ፎረም

source: History
am: ታሪክ

# educational_resource
source: Resources
am: ምንጮች

source: Logout
am: ውጣ

# fName
source: First Name
am: ስም

# lName
source: Last Name
am: የአባት ስም

source: Email
am: ኢሜይል

source: Optional
am: አማራጭ

source: Phone
am: ስልክ

source: Save Changes
am: ለውጦችን አስቀምጥ

source: Ask Question
am: ጥያቄ አቅርብ

source: Reply
am: መልስ

source: Edit
am: አስተካክል

source: Delete
am: ሰርዝ

source: Cancel
am: ይቅር

source: Save
am: አስቀምጥ

# wanna_delete
source: Are you sure you want to delete this question?
am: እርግጠኛ ነህ/ነሽ?

source: Your Question
am: የእርስዎ ጥያቄ

# descripe_issue
source: Describe your issue
am: ችግሩን አመልክት

source: Attach Image
am: ምስል አቀምጥ

source: Take Photo
am: ፎቶ ኣንሳ

# choose_fgallery
source: From Gallery
am: ከቤተ መዝገብ

# submit_question
source: Submit
am: አቅርብ

source: Back
am: ተመለስ

# confirm
source: Confirm Image
am: ምስል አረጋግጥ

source: Send
am: ላክ

# copy
source: Copy Response
am: መልሱን ቅዳ
